In [69]:
import csv
import numpy as np
import pandas as pd

from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score, KFold
from sklearn import tree

In [53]:
df = pd.read_csv('data/titanic.txt', index_col=0)
df.head()

,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
row.names,,,,,,,,,,
1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [54]:
X=df[['pclass','age','sex']]
y = df['survived']
print("Feature names:",list(X.columns))
print("Target Name:", y.name)

Feature names: ['pclass', 'age', 'sex']
Target Name: survived

In [55]:
#Check for missing values
X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1313 entries, 1 to 1313
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  1313 non-null   object
 1   age     633 non-null    float64
 2   sex     1313 non-null   object
dtypes: float64(1), object(2)
memory usage: 41.0+ KB

In [56]:
mean = np.mean(X['age']);
print(mean)
X=X.fillna(value={'age':mean})
X.info()

31.19418104265403
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1313 entries, 1 to 1313
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  1313 non-null   object
 1   age     1313 non-null   float64
 2   sex     1313 non-null   object
dtypes: float64(1), object(2)
memory usage: 41.0+ KB

In [58]:
encoding = {'pclass':{'1st': 1, '2nd': 2, '3rd':3},'sex':{'male':0,'female':1}}
X = X.replace(encoding)

In [59]:
X

           pclass        age  sex
row.names
1               1  29.000000    1
2               1   2.000000    1
3               1  30.000000    0
4               1  25.000000    1
5               1   0.916700    0
...           ...        ...  ...
1309            3  31.194181    0
1310            3  31.194181    0
1311            3  31.194181    0
1312            3  31.194181    1
1313            3  31.194181    0

[1313 rows x 3 columns]

In [61]:
X['pclass'] = X['pclass'].astype('category')
X['sex'] = X['sex'].astype('category')

In [67]:
X_train, X_test, y_train, y_test = train_test_split(X, y, train_size=0.75, random_state=33)

In [81]:
clf = tree.DecisionTreeClassifier(criterion='gini', max_depth=3, min_samples_leaf=5)
clf = clf.fit(X_train, y_train)
clf.score(X_test, y_test)

0.7933130699088146